let fetch = require('node-fetch')
let handler = async (m, { conn }) => {
	conn.send3ButtonLoc(m.chat, await (await fetch(fla + 'sewa bot')).buffer(), `
┌───『 𝙎𝙀𝙒𝘼 𝘽𝙊𝙏 』──⬣
⬣ 𝙇𝙄𝙎𝙏 𝙃𝘼𝙍𝙂𝘼 𝘿𝙄 𝘽𝘼𝙒𝘼𝙃 𝙔𝘼
╔═══════════════════
║╭──『 𝗗𝗢𝗡𝗔𝗦𝗜 𝗢𝗪𝗡𝗘𝗥 』──⬣
║│⬣ 𝘋𝘢𝘯𝘢 : 088233832771
║│⬣ 𝘎𝘰𝘱𝘢𝘺 : 088233832771
║╰────────────⬣
╠══════════════════
║╭──『 𝗟𝗜𝗦𝗧 𝗛𝗔𝗥𝗚𝗔 』──⬣
║│⬣ 𝘊𝘩𝘢𝘵 𝘰𝘸𝘯𝘦𝘳 𝘺𝘢
║│⬣ 𝙊𝙒𝙉𝙀𝙍 @${global.owner[0]} 
║╰────────────⬣  
╠══════════════════
║     𝘛𝘌𝘙𝘛𝘈𝘙𝘐𝘒 𝘚𝘌𝘞𝘈 𝘉𝘖𝘛 
║  𝘚𝘐𝘓𝘈𝘏𝘒𝘈𝘕 𝘏𝘜𝘉𝘜𝘕𝘎𝘐 𝘖𝘞𝘕𝘌𝘙
╠══════════════════
║╭─────────────────
║│ ©𝟮𝟬𝟮𝟭 𝗥𝗽𝗴 𝘄𝗮𝗯𝗼𝘁-𝗮𝗾
║│ 𝗦𝗰𝗿𝗶𝗽 𝗼𝗿𝗶𝗴𝗶𝗻𝗮𝗹 𝗯𝘆 𝗡𝘂𝗿𝘂𝘁𝗼𝗺𝗼
║╰──────────────────
╰──〘 ${namabot} 〙──⬣
`.trim(), footer, 'Dana', '#viadana', 'Gopay', '#viagopay', m)
}

handler.command = /^beli(bot)$/i

module.exports = handler
